** Flavors
#+begin_src emacs-lisp :exports results :eval never-export
(setq projects '())
(defun prepare-project-list ()
  (let ((el (org-element-at-point)))
    (push
     (list
      (org-element-property :STATUS el)
      (org-element-property :raw-value el)
      ;; NOTE: linking to heading doesn't seem to render on github atm
      ;; See: https://github.com/novoid/github-orgmode-tests
      ;; (concat "[[*" (org-element-property :raw-value el) "][" (org-element-property :raw-value el) "]]")
      (org-element-property :PLATFORM el)
      (org-element-property :WOULD_USE el)
      (org-element-property :SOURCE el)) projects)))
(org-map-entries #'prepare-project-list "HTYPE=\"flavor\"+LEVEL=3")
(setq projects (nreverse projects))
(push '("🔮" "Name" "Platform" "Would Use" "Source") projects)
#+end_src

#+RESULTS:
| 🔮 | Name                                         | Platform         | Would Use            | Source |
| 🚧 | Base                                         | Local            | YES                  | [[https://github.com/geekodour/smol-go-chonky-go/tree/base][source]] |
| 🚧 | Base + Observability + Compose               | Local            | NO                   | nil    |
| 🚧 | w LB/RP + HTTPS                              | AWS EC2          | NO                   | nil    |
| 🚧 | w ALB + HTTPS + Subnets                      | AWS ECS(EC2)     | YES                  | nil    |
| 🚧 | w/o LB/RP + HTTPS                            | AWS ECS(EC2)     | NO (experiment)      | nil    |
| 🚧 | w traefik + HTTPS + Subnets                  | AWS ECS(EC2)     | NO (experiment)      | nil    |
| 🚧 | w Nomad + traefik + HTTPS + Subnets          | Hetzner          | MAYBE                | nil    |
| 🚧 | w Nomad + traefik + HTTPS + Kong + Subnets   | Hetzner          | MAYBE                | nil    |
| 🚧 | Fly.io                                       | Fly              | YES                  | nil    |
| 🚧 | w Cloudflare Tunnel                          | Local+Cloudflare | YES (in development) | nil    |
| 🚧 | Instead of containers, we nix                | EC2, NixOS AMI   | YES (experimental)   | nil    |
| 🚧 | w Caddy, serve static files + Cloudflare CDN | AWS ECS(EC2)     | NO (experimental)    | nil    |
| 🚧 | Run the the browser w wasm                   | Browser          | NO (experimental)    | nil    |

